<script setup>
import { Head, Link } from '@inertiajs/vue3';

defineProps({
    canLogin: {
        type: Boolean,
    },
    canRegister: {
        type: Boolean,
    },
    laravelVersion: {
        type: String,
        requiemerald: true,
    },
    phpVersion: {
        type: String,
        requiemerald: true,
    },
});
</script>

<template>
    <Head title="Welcome" />

    <div
        class="relative sm:flex sm:justify-center sm:items-center min-h-screen bg-dots-darker bg-center bg-gray-100 dark:bg-dots-lighter dark:bg-gray-900 selection:bg-emerald-500 selection:text-white z-40"
    >
        <div v-if="canLogin" class="sm:fixed sm:top-0 sm:right-0 p-6 text-right">
            <Link
                v-if="$page.props.auth.user && $page.props.auth.user.role=='teacher'"
                :href="route('teacher.dashboard')"
                class="font-semibold text-gray-600 hover:text-gray-900 dark:text-gray-400 dark:hover:text-white focus:outline focus:outline-2 focus:rounded-sm focus:outline-emerald-500"
                >Панель управления</Link
            >
            <Link
                v-else-if="$page.props.auth.user && $page.props.auth.user.role=='user'"
                :href="route('dashboard')"
                class="font-semibold text-gray-600 hover:text-gray-900 dark:text-gray-400 dark:hover:text-white focus:outline focus:outline-2 focus:rounded-sm focus:outline-emerald-500"
                >Панель управления</Link
            >

            <template v-else>
                <Link
                    :href="route('login')"
                    class="font-semibold text-gray-600 hover:text-gray-900 dark:text-gray-400 dark:hover:text-white focus:outline focus:outline-2 focus:rounded-sm focus:outline-emerald-500"
                    >Вход</Link
                >

                <Link
                    v-if="canRegister"
                    :href="route('register')"
                    class="ml-4 font-semibold text-gray-600 hover:text-gray-900 dark:text-gray-400 dark:hover:text-white focus:outline focus:outline-2 focus:rounded-sm focus:outline-emerald-500"
                    >Регистрация</Link
                >
            </template>
        </div>

        <div class="max-w-7xl mx-auto p-6 lg:p-8">
            <div class="flex justify-center">
                <svg
                    viewBox="0 0 90 91"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    class="h-16 w-auto bg-gray-100 dark:bg-gray-900 stroke-emerald-500"
                >
                        <path xmlns="http://www.w3.org/2000/svg" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M37.8874 8.90536L37.8182 8.5848L37.4967 8.52049L2.14132 1.44942L1.41493 1.30414L1.55189 2.03215L8.2694 37.741L8.33154 38.0714L8.66089 38.1385L43.4791 45.2374L9.37545 51.6529L9.04512 51.715L8.97797 52.0444L1.55335 88.4604L1.40042 89.2104L2.14868 89.049L38.2111 81.2709L38.5317 81.2017L38.596 80.8802L45.196 47.8801L51.4029 80.8745L51.4651 81.2049L51.7944 81.272L88.2104 88.6967L88.9604 88.8496L88.7991 88.1013L81.0209 52.0389L80.9517 51.7183L80.6302 51.654L48.4844 45.2248L81.3446 38.1374L81.6652 38.0682L81.7295 37.7467L88.8006 2.39131L88.9459 1.66492L88.2179 1.80187L52.509 8.51938L52.1786 8.58153L52.1115 8.91088L45.2001 42.8097L37.8874 8.90536ZM44.5383 46.0557L44.5339 46.0769L44.537 46.0763L37.6797 80.3625L2.68611 87.9101L9.89066 52.5735L44.5383 46.0557ZM52.3235 80.3593L45.8221 45.7991L46.0311 45.754L80.1125 52.5703L87.6601 87.5639L52.3235 80.3593ZM80.8132 37.229L46.0234 44.7327L45.8362 44.6952L53.0242 9.44001L87.6747 2.92159L80.8132 37.229ZM2.6716 2.57528L36.979 9.43675L44.5266 44.4304L9.19002 37.2258L2.6716 2.57528Z" fill="#FF2D20"/>
                </svg>
            </div>

            <div class="mt-16">
                <div class="grid grid-cols-1 md:grid-cols-2 gap-6 lg:gap-8">
                    <div
                        class="col-span-1 md:col-span-2 scale-100 p-6 bg-white dark:bg-gray-800/50 dark:bg-gradient-to-bl from-gray-700/50 via-transparent dark:ring-1 dark:ring-inset dark:ring-white/5 rounded-lg shadow-2xl shadow-gray-500/20 dark:shadow-none flex motion-safe:hover:scale-[1.01] transition-all duration-250 focus:outline focus:outline-2 focus:outline-emerald-500"
                    >
                        <div>
                            <div
                                class="h-16 w-16 bg-emerald-50 dark:bg-emerald-800/20 flex items-center justify-center rounded-full"
                            >
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    fill="none"
                                    viewBox="0 0 48 48"
                                    stroke-width="1.5"
                                    class="w-12 h-12 stroke-emerald-500"
                                >
                                    <path xmlns="http://www.w3.org/2000/svg" class="st0" d="M8.278,35.973c0,3.048,2.48,5.527,5.528,5.527h22.488c0.276,0,0.5-0.224,0.5-0.5v-1.53  c0-0.104-0.039-0.195-0.093-0.274c-0.006-0.009-0.004-0.021-0.01-0.03c-0.705-0.92-1.078-2.024-1.078-3.193s0.373-2.273,1.078-3.194  c0.006-0.008,0.004-0.02,0.01-0.029c0.054-0.08,0.093-0.171,0.093-0.275v-1.03h2.237c0.276,0,0.5-0.224,0.5-0.5v-1.53  c0-0.104-0.039-0.195-0.093-0.275c-0.006-0.009-0.003-0.021-0.01-0.029c-0.705-0.921-1.077-2.025-1.077-3.194  s0.373-2.273,1.077-3.194c0.006-0.008,0.004-0.02,0.01-0.029c0.054-0.08,0.093-0.171,0.093-0.275v-1.53c0-0.276-0.224-0.5-0.5-0.5  h-5.227v-4.659l3.947-1.862v3.428c-0.563,0.206-0.969,0.742-0.969,1.376c0,0.81,0.659,1.469,1.469,1.469  c0.811,0,1.47-0.659,1.47-1.469c0-0.634-0.406-1.17-0.97-1.376V13.08c0-0.088-0.029-0.166-0.068-0.238  c-0.01-0.019-0.022-0.034-0.035-0.051c-0.043-0.059-0.095-0.107-0.159-0.142c-0.008-0.005-0.012-0.015-0.021-0.019L25.854,6.55  c-0.138-0.066-0.297-0.066-0.435,0l-12.615,6.08c-0.173,0.083-0.284,0.26-0.283,0.452c0.001,0.193,0.112,0.368,0.287,0.45  l4.661,2.198v4.659h-0.926c-1.48,0-2.87,0.574-3.912,1.616c-1.042,1.042-1.615,2.431-1.615,3.912c0,1.894,0.958,3.567,2.415,4.564  c-1.337,0.09-2.585,0.627-3.536,1.579C8.852,33.102,8.278,34.491,8.278,35.973z M34.652,35.473H13.15c-0.276,0-0.5,0.224-0.5,0.5  s0.224,0.5,0.5,0.5h21.502c0.069,0.884,0.314,1.729,0.735,2.497H13.972c-1.653,0-2.998-1.344-2.998-2.997  c0-0.803,0.312-1.556,0.874-2.119c0.575-0.567,1.329-0.879,2.124-0.879h21.416C34.966,33.744,34.722,34.588,34.652,35.473z   M37.39,25.417H15.887c-0.276,0-0.5,0.224-0.5,0.5s0.224,0.5,0.5,0.5H37.39c0.069,0.885,0.314,1.729,0.735,2.498H16.709  c-1.653,0-2.998-1.345-2.998-2.998c0-0.802,0.312-1.556,0.874-2.119c0.575-0.567,1.329-0.879,2.124-0.879h21.415  C37.703,23.688,37.459,24.533,37.39,25.417z M38.252,19.142c-0.259,0-0.469-0.21-0.469-0.469s0.21-0.469,0.469-0.469  s0.47,0.21,0.47,0.469S38.511,19.142,38.252,19.142z M14.184,13.075l11.454-5.52l11.453,5.52l-3.286,1.55v-1.448  c0-0.065-0.014-0.127-0.037-0.185c-0.008-0.021-0.022-0.037-0.033-0.057c-0.019-0.034-0.038-0.068-0.065-0.096  c-0.017-0.018-0.038-0.032-0.057-0.048c-0.028-0.022-0.056-0.044-0.089-0.06c-0.024-0.012-0.05-0.019-0.076-0.027  c-0.022-0.007-0.041-0.019-0.064-0.022l-1.819-0.291c-3.933-0.632-7.921-0.633-11.854,0l-1.82,0.291  c-0.023,0.004-0.042,0.016-0.064,0.022c-0.026,0.008-0.052,0.015-0.076,0.027c-0.033,0.016-0.06,0.037-0.089,0.06  c-0.02,0.016-0.04,0.029-0.057,0.048c-0.027,0.029-0.046,0.062-0.065,0.096c-0.011,0.019-0.025,0.036-0.033,0.057  c-0.023,0.058-0.037,0.119-0.037,0.185v1.448L14.184,13.075z M18.469,15.414v-1.81l1.4-0.224c3.827-0.615,7.708-0.615,11.537,0  l1.398,0.223v1.811v4.976H18.469V15.414z M12.016,25.917c0-1.214,0.47-2.353,1.322-3.205c0.854-0.853,1.992-1.323,3.205-1.323h1.426  h15.335h5.227v0.53H16.709c-1.059,0-2.063,0.415-2.828,1.169c-0.754,0.755-1.169,1.759-1.169,2.828c0,2.204,1.793,3.998,3.998,3.998  h21.822v0.53h-2.237H16.543C14.046,30.445,12.016,28.414,12.016,25.917z M13.806,31.445h2.737h19.251v0.53H13.972  c-1.059,0-2.062,0.415-2.828,1.169c-0.754,0.754-1.169,1.758-1.169,2.828c0,2.204,1.793,3.997,3.998,3.997h21.822v0.53H13.806  c-2.497,0-4.528-2.031-4.528-4.527c0-1.214,0.47-2.353,1.323-3.205C11.454,31.915,12.592,31.445,13.806,31.445z"/>
                                </svg>
                            </div>

                            <h2 class="mt-6 text-xl font-semibold text-gray-900 dark:text-white">Добро пожаловать на наш сервис для репетиторов иностранных языков!</h2>

                            <p class="mt-4 text-gray-500 dark:text-gray-400 text-sm leading-relaxed">
                                Мы предоставляем инструменты, которые позволяют репетиторам создавать упражнения для изучения иностранных языков, которые могут быть использованы их учениками. Мы понимаем, что каждый ученик уникален и имеет свои индивидуальные потребности в изучении языков, поэтому мы даем возможность нашим репетиторам создавать упражнения, которые могут соответствовать их потребностям.
                            </p>
                            <p class="mt-4 text-gray-500 dark:text-gray-400 text-sm leading-relaxed">
                                Наш сервис предлагает репетиторам различные инструменты, которые помогают создавать уникальные и интересные упражнения для изучения иностранных языков.
                            </p>
                        </div>
                    </div>

                    <div
                        class="col-span-1 scale-100 p-6 bg-white dark:bg-gray-800/50 dark:bg-gradient-to-bl from-gray-700/50 via-transparent dark:ring-1 dark:ring-inset dark:ring-white/5 rounded-lg shadow-2xl shadow-gray-500/20 dark:shadow-none flex motion-safe:hover:scale-[1.01] transition-all duration-250 focus:outline focus:outline-2 focus:outline-emerald-500"
                    >
                        <div>
                            <div
                                class="h-16 w-16 bg-emerald-50 dark:bg-emerald-800/20 flex items-center justify-center rounded-full"
                            >
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    fill="none"
                                    viewBox="0 0 64 64"
                                    stroke-width="4"
                                    class="w-12 h-12 stroke-emerald-500"
                                >
                                    <path xmlns="http://www.w3.org/2000/svg" d="M43.31,37.52A11.83,11.83,0,0,1,31.25,49.35,12.1,12.1,0,0,1,19.63,37.12V20.64a.1.1,0,0,1,.08-.1,90.43,90.43,0,0,1,12.08-1,82.5,82.5,0,0,1,11.57,1,.09.09,0,0,1,.07.1Z"/>
                                    <path xmlns="http://www.w3.org/2000/svg" d="M19.63,26,9,20.47a.1.1,0,0,1,0-.18L31.49,8.86h.09L54,20.17a.1.1,0,0,1,0,.18L43.43,26"/>
                                    <path xmlns="http://www.w3.org/2000/svg" d="M19.63,32.19H17.7s-2.94,0-2.94,4.52c0,4.17,2.93,4.17,2.93,4.17l2.51-.05"/>
                                    <path xmlns="http://www.w3.org/2000/svg" d="M43.3,32.7h1.93s3,0,3,4.53c0,4.17-2.94,4.17-2.94,4.17H42.65"/>
                                    <line xmlns="http://www.w3.org/2000/svg" x1="52.72" y1="45.04" x2="52.72" y2="21.03"/>
                                    <circle xmlns="http://www.w3.org/2000/svg" cx="52.72" cy="47.36" r="2.31"/>
                                    <polyline xmlns="http://www.w3.org/2000/svg" points="37.76 47.53 37.76 55.15 25.89 55.15 25.89 47.95"/>
                                    <path xmlns="http://www.w3.org/2000/svg" d="M43.43,30.13a63,63,0,0,0-11.61-1,60.25,60.25,0,0,0-12.19,1"/>

                                </svg>
                            </div>

                            <h2 class="mt-6 text-xl font-semibold text-gray-900 dark:text-white">Ученики</h2>

                            <p class="mt-4 text-gray-500 dark:text-gray-400 text-sm leading-relaxed">
                                Каждый ученик получает свой личный аккаунт и имеет доступ к упражнениям своего репетитора. Ученики могут работать с упражнениями онлайн в любое время, в любом месте и на любом устройстве. Мы убеждены, что такой подход не только позволит развивать навыки учеников, но и сделает процесс изучения языков более увлекательным и эффективным.
                            </p>
                        </div>
                    </div>

                    <div
                        class="col-span-1 scale-100 p-6 bg-white dark:bg-gray-800/50 dark:bg-gradient-to-bl from-gray-700/50 via-transparent dark:ring-1 dark:ring-inset dark:ring-white/5 rounded-lg shadow-2xl shadow-gray-500/20 dark:shadow-none flex motion-safe:hover:scale-[1.01] transition-all duration-250 focus:outline focus:outline-2 focus:outline-emerald-500"
                    >
                        <div>
                            <div
                                class="h-16 w-16 bg-emerald-50 dark:bg-emerald-800/20 flex items-center justify-center rounded-full"
                            >
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    fill="none"
                                    viewBox="0 0 48 48"
                                    stroke-width="1.5"
                                    class="w-12 h-12 stroke-emerald-500"
                                >
                                    <path xmlns="http://www.w3.org/2000/svg" class="st0" d="M11.12,24.5c0.244,0,0.483-0.048,0.715-0.118c0.131,0.203,0.268,0.406,0.412,0.608  c-2.223,3.148-2.815,6.145-1.59,8.26c1.065,1.84,3.372,2.836,6.46,2.836c0.473,0,0.976-0.041,1.484-0.088  c1.045,2.292,2.381,3.937,3.895,4.801C22.49,40.867,22.47,40.931,22.47,41c0,1.373,1.117,2.49,2.49,2.49  c1.368,0,2.48-1.117,2.48-2.49c0-0.066-0.02-0.128-0.025-0.193c1.515-0.873,2.851-2.521,3.894-4.809  c0.507,0.047,1.011,0.088,1.483,0.088c3.088,0,5.395-0.996,6.46-2.836c1.229-2.121,0.639-5.117-1.587-8.255  c1.456-2.042,2.21-4.016,2.204-5.755c0.819-0.415,1.349-1.258,1.349-2.201c0-1.373-1.116-2.49-2.489-2.49  c-0.487,0-0.941,0.14-1.334,0.395c-1.499-0.864-3.589-1.196-6.091-0.963c-1.041-2.288-2.376-3.937-3.89-4.81  c0.005-0.064,0.025-0.127,0.025-0.193c0-1.368-1.112-2.48-2.48-2.48c-1.373,0-2.49,1.112-2.49,2.48c0,0.071,0.019,0.133,0.026,0.203  c-1.514,0.871-2.849,2.519-3.893,4.804c-3.823-0.358-6.717,0.629-7.946,2.753c-0.504,0.872-0.691,1.893-0.593,3.024  c-0.855,0.404-1.425,1.28-1.425,2.255C8.64,23.388,9.752,24.5,11.12,24.5z M19.231,15.064c1.399,0.187,2.872,0.552,4.398,1.088  c-0.979,0.439-1.96,0.918-2.928,1.474c-0.945,0.543-1.852,1.153-2.735,1.791C18.267,17.841,18.69,16.383,19.231,15.064z   M30.68,15.065c0.541,1.319,0.964,2.777,1.265,4.353c-0.883-0.638-1.79-1.248-2.734-1.79c-0.946-0.547-1.929-1.028-2.923-1.474  C27.803,15.621,29.293,15.251,30.68,15.065z M30.68,34.924c-1.413-0.196-2.905-0.568-4.396-1.095  c0.995-0.447,1.98-0.928,2.925-1.475c0.945-0.543,1.852-1.153,2.734-1.79C31.641,32.14,31.212,33.62,30.68,34.924z M28.711,18.494  c1.208,0.694,2.37,1.481,3.466,2.329c0.184,1.368,0.283,2.767,0.283,4.167c0,1.396-0.1,2.794-0.284,4.17  c-1.095,0.848-2.258,1.632-3.467,2.327c-1.207,0.698-2.469,1.312-3.749,1.836c-1.253-0.51-2.517-1.122-3.76-1.837  c-1.208-0.694-2.37-1.481-3.466-2.329c-0.184-1.361-0.283-2.76-0.283-4.167c0-1.403,0.1-2.801,0.284-4.171  c1.095-0.848,2.258-1.632,3.465-2.326c1.243-0.715,2.507-1.327,3.76-1.837C26.241,17.181,27.502,17.794,28.711,18.494z   M33.277,21.725c1.216,1.049,2.283,2.157,3.142,3.265c-0.863,1.113-1.929,2.219-3.142,3.26c0.109-1.08,0.184-2.169,0.184-3.259  C33.46,23.896,33.386,22.806,33.277,21.725z M19.231,34.924c-0.533-1.304-0.962-2.785-1.264-4.361  c0.883,0.637,1.79,1.247,2.734,1.791c0.969,0.557,1.949,1.036,2.928,1.474C22.108,34.362,20.636,34.729,19.231,34.924z   M16.633,28.254c-1.215-1.048-2.281-2.155-3.142-3.265c0.863-1.113,1.93-2.219,3.143-3.259c-0.109,1.077-0.183,2.164-0.183,3.259  C16.45,26.088,16.524,27.177,16.633,28.254z M11.522,32.75c-0.989-1.708-0.478-4.208,1.361-6.92c1.064,1.33,2.396,2.652,3.915,3.866  c0.295,1.924,0.778,3.743,1.402,5.336C14.941,35.274,12.517,34.466,11.522,32.75z M24.96,42.49c-0.821,0-1.49-0.668-1.49-1.49  c0-0.118,0.015-0.232,0.046-0.352c0.163-0.665,0.757-1.128,1.444-1.128c0.68,0,1.281,0.476,1.433,1.132  c0.001,0.005,0.003,0.011,0.004,0.017c0.03,0.111,0.044,0.217,0.044,0.331C26.44,41.822,25.776,42.49,24.96,42.49z M27.126,39.819  c-0.424-0.776-1.25-1.299-2.166-1.299c-0.93,0-1.75,0.513-2.176,1.291c-1.175-0.751-2.265-2.121-3.14-3.941  c1.698-0.26,3.479-0.746,5.315-1.468c1.778,0.709,3.59,1.205,5.307,1.467C29.392,37.688,28.302,39.06,27.126,39.819z M38.388,32.75  c-0.994,1.717-3.42,2.524-6.678,2.282c0.623-1.592,1.105-3.41,1.4-5.342c1.518-1.204,2.849-2.525,3.916-3.861  C38.87,28.534,39.38,31.035,38.388,32.75z M40.22,17.04c0,0.636-0.404,1.197-1.015,1.398c-0.95,0.333-1.955-0.425-1.955-1.398  c0-0.437,0.185-0.845,0.511-1.125c0.27-0.239,0.605-0.365,0.97-0.365C39.552,15.55,40.22,16.218,40.22,17.04z M36.665,15.677  c-0.262,0.399-0.415,0.868-0.415,1.363c0,1.368,1.112,2.48,2.48,2.48c0.046,0,0.093-0.009,0.14-0.012  c-0.071,1.384-0.711,2.998-1.839,4.65c-1.064-1.332-2.397-2.657-3.92-3.874c-0.297-1.943-0.772-3.728-1.404-5.333  C33.734,14.799,35.427,15.045,36.665,15.677z M24.96,7.5c0.816,0,1.48,0.664,1.48,1.48c0,0.114-0.014,0.22-0.048,0.349  c-0.15,0.661-0.753,1.141-1.433,1.141c-0.688,0-1.282-0.467-1.446-1.148C23.484,9.212,23.47,9.098,23.47,8.98  C23.47,8.164,24.139,7.5,24.96,7.5z M22.785,10.171c0.427,0.785,1.245,1.299,2.175,1.299c0.921,0,1.75-0.529,2.17-1.306  c1.176,0.76,2.263,2.133,3.135,3.953c-1.693,0.252-3.471,0.736-5.306,1.461c-1.845-0.725-3.625-1.209-5.314-1.461  C20.52,12.3,21.609,10.929,22.785,10.171z M18.199,14.958c-0.629,1.603-1.103,3.385-1.4,5.333c-1.516,1.203-2.846,2.524-3.915,3.86  c-0.054-0.079-0.108-0.157-0.16-0.236c0.017-0.015,0.03-0.033,0.047-0.049c0.051-0.045,0.093-0.095,0.139-0.144  c0.099-0.102,0.188-0.21,0.267-0.327c0.04-0.06,0.078-0.12,0.113-0.183c0.069-0.125,0.124-0.255,0.171-0.39  c0.021-0.061,0.047-0.119,0.063-0.182c0.052-0.2,0.086-0.406,0.086-0.62c0-0.174-0.019-0.344-0.053-0.509  c-0.004-0.018-0.012-0.034-0.016-0.052c-0.186-0.803-0.759-1.455-1.513-1.753c-0.006-0.002-0.012-0.003-0.017-0.005  c-0.143-0.055-0.291-0.099-0.446-0.127c-0.05-0.009-0.102-0.009-0.152-0.015c-0.097-0.012-0.192-0.03-0.292-0.03  c-0.014,0-0.025,0.005-0.038,0.005c-0.012,0-0.024-0.003-0.037-0.003c-0.003-0.051-0.011-0.105-0.012-0.156  c-0.003-0.093-0.002-0.184,0.001-0.275c0.004-0.142,0.014-0.28,0.03-0.416c0.01-0.087,0.02-0.174,0.036-0.258  c0.026-0.141,0.062-0.276,0.102-0.41c0.021-0.07,0.037-0.142,0.062-0.21c0.072-0.197,0.155-0.387,0.259-0.567  C12.517,15.524,14.934,14.713,18.199,14.958z M10.731,20.58c0.112-0.033,0.242-0.05,0.389-0.05c0.821,0,1.49,0.668,1.49,1.49  c0,0.554-0.31,1.058-0.811,1.316c-0.21,0.109-0.438,0.164-0.68,0.164c-0.816,0-1.48-0.664-1.48-1.48  C9.64,21.35,10.085,20.759,10.731,20.58z"/>
                                    <path xmlns="http://www.w3.org/2000/svg" class="st0" d="M24.957,29.911c2.712,0,4.918-2.207,4.918-4.918s-2.206-4.918-4.918-4.918s-4.918,2.206-4.918,4.918  S22.245,29.911,24.957,29.911z M24.957,21.074c2.16,0,3.918,1.758,3.918,3.918c0,2.161-1.758,3.918-3.918,3.918  s-3.918-1.758-3.918-3.918C21.039,22.832,22.797,21.074,24.957,21.074z"/>
                                </svg>
                            </div>

                            <h2 class="mt-6 text-xl font-semibold text-gray-900 dark:text-white">Наша миссия</h2>

                            <p class="mt-4 text-gray-500 dark:text-gray-400 text-sm leading-relaxed">
                                Наш сервис для репетиторов иностранных языков - это надежный помощник в процессе обучения. Мы стремимся облегчить вашу работу и помочь достичь лучших результатов в изучении иностранных языков в более эффективном и увлекательном формате.                            </p>
                        </div>
                    </div>
                </div>
            </div>

            <div class="flex justify-center mt-16 px-6 sm:items-center sm:justify-between">
                <div class="text-center text-sm text-gray-500 dark:text-gray-400 sm:text-left">
                    <div class="flex items-center gap-4">
                        <p
                            class="group inline-flex items-center hover:text-gray-700 dark:hover:text-white focus:outline focus:outline-2 focus:rounded-sm focus:outline-emerald-500"
                        >
                            Xample.ru 2023
                        </p>
                    </div>
                </div>

                <div class="ml-4 text-center text-sm text-gray-500 dark:text-gray-400 sm:text-right sm:ml-0">
                    Laravel v{{ laravelVersion }} (PHP v{{ phpVersion }})
                </div>
            </div>
        </div>
    </div>
</template>

<style>
.bg-dots-darker {
    background-image: url("data:image/svg+xml,%3Csvg width='30' height='30' viewBox='0 0 30 30' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M1.22676 0C1.91374 0 2.45351 0.539773 2.45351 1.22676C2.45351 1.91374 1.91374 2.45351 1.22676 2.45351C0.539773 2.45351 0 1.91374 0 1.22676C0 0.539773 0.539773 0 1.22676 0Z' fill='rgba(0,0,0,0.07)'/%3E%3C/svg%3E");
}
@media (prefers-color-scheme: dark) {
    .dark\:bg-dots-lighter {
        background-image: url("data:image/svg+xml,%3Csvg width='30' height='30' viewBox='0 0 30 30' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M1.22676 0C1.91374 0 2.45351 0.539773 2.45351 1.22676C2.45351 1.91374 1.91374 2.45351 1.22676 2.45351C0.539773 2.45351 0 1.91374 0 1.22676C0 0.539773 0.539773 0 1.22676 0Z' fill='rgba(255,255,255,0.07)'/%3E%3C/svg%3E");
    }
}
</style>
